src/cf/Catalogs/АлгоритмыПроверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>АлгоритмыПроверки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыражениеУсловия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаКомбинацииУсловий</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаУсловия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаданияУсловия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗаданияУсловия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/ВыборАлгоритмаПроверкиПредметаПроцесса/Ext/Form/Module.bsl
#Область ОписаниеПараметровФормы

// ИмяПредмета - имя текущего предмета в настройках процесса.
// АлгоритмПроверки - текущий алгоритм в настройках процесса.
// ПредметыПроцесса - Соответствие - все предметы процесса.
//  * Ключ - СправочникСсылка.ИменаПредметов
//  * Значение - Произвольный - ссылка на предмет процесса. Допустима пустая ссылка.
//                              т.е. тоже самое, что хранится в самом процессе/шаблоне. 

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяПредмета = Параметры.ИмяПредмета;
	АлгоритмПроверки = Параметры.АлгоритмПроверки;
	
	Для Каждого ПредметПроцесса Из Параметры.ПредметыПроцесса Цикл
		
		СтрокаТаблицы = ПредметыПроцесса.Добавить();
		СтрокаТаблицы.ИмяПредмета = ПредметПроцесса.Ключ;
		СтрокаТаблицы.ТипОбъекта = Перечисления.ТипыОбъектов.ТипОбъектаПоСсылке(
			ПредметПроцесса.Значение);
		
		Если ЗначениеЗаполнено(ПредметПроцесса.Значение) Тогда
			ПредставлениеПредмета = СтрШаблон("%1 (%2)",
				ПредметПроцесса.Значение, ПредметПроцесса.Ключ); 
		Иначе
			ПредставлениеПредмета = Строка(ПредметПроцесса.Ключ);
		КонецЕсли;
		
		Элементы.ИмяПредмета.СписокВыбора.Добавить(ПредметПроцесса.Ключ, ПредставлениеПредмета);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяПредметаПриИзменении(Элемент)
	
	АлгоритмПроверки = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмПроверкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	
	ТипОбъекта = ТипОбъектаДляИмениПредмета(); 
	Если ТипОбъекта <> Неопределено Тогда	
		ПараметрыФормы.Вставить("ТипОбъекта", ТипОбъекта);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.АлгоритмыПроверки.ФормаВыбора",
		ПараметрыФормы,
		Элементы.АлгоритмПроверки);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Если Не ЗначениеЗаполнено(ИмяПредмета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не указан предмет'"),, "ИмяПредмета");
		
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АлгоритмПроверки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не указано алгоритм проверки предмета'"),, "АлгоритмПроверки");
		
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяПредмета", ИмяПредмета);
	Результат.Вставить("АлгоритмПроверки", АлгоритмПроверки);
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ТипОбъектаДляИмениПредмета()
	
	Если Не ЗначениеЗаполнено(ИмяПредмета) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяПредмета", ИмяПредмета);
	
	НаденныеСтроки = ПредметыПроцесса.НайтиСтроки(Отбор);
	Если НаденныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НаденныеСтроки[0].ТипОбъекта) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат НаденныеСтроки[0].ТипОбъекта;
	
КонецФункции

#КонецОбласти
